Repository: urmatgit/CountrymenFund-webapi
Catalog: src/Host/Localization/*/Infrastructure-*.po
Languages: ru

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Role Not Found
ru: Роль не найдена

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Register role failed
ru: Не удалось зарегистрировать роль

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Role {0} Created.
ru: Роль {0} создана.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Not allowed to modify {0} Role.
ru: Не разрешено изменять {0} роль.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Update role failed
ru: Не удалось обновить роль

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Role {0} Updated.
ru: Роль {0} обновлена.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Not allowed to modify Permissions for this Role.
ru: Не разрешено изменять права доступа для этой роли.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Update permissions failed.
ru: Не удалось изменить права доступа.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Permissions Updated.
ru: Права доступа обновлены.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Not allowed to delete {0} Role.
ru: Не разрешено удалять {0} роль.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Not allowed to delete {0} Role as it is being used.
ru: Не разрешено удалять роль {0} как она используется.

# FSH.WebApi.Infrastructure.Identity.RoleService
source: Role {0} Deleted.
ru: Роль {0} удалена.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: Authentication Failed.
ru: Ошибка авторизации.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: User Not Active. Please contact the administrator.
ru: Пользователь не активен. Пожалуйста, свяжитесь с администратором.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: E-Mail not confirmed.
ru: E-Mail не подтвержден.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: Tenant is not Active. Please contact the Application Administrator.
ru: Владелец не активен. Пожалуйста, свяжитесь с администратором приложения.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: Tenant Validity Has Expired. Please contact the Application Administrator.
ru: Срок годности владельца истек. Пожалуйста, свяжитесь с администратором приложения.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: Invalid Refresh Token.
ru: Неверный токен обновления.

# FSH.WebApi.Infrastructure.Identity.TokenService
source: Invalid Token.
ru: Неверный токен.

# FSH.WebApi.Infrastructure.Identity.UserService
source: An error occurred while confirming E-Mail.
ru: Произошла ошибка при подтверждении электронной почты.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Account Confirmed for E-Mail {0}. You can now use the /api/tokens endpoint to generate JWT.
ru: Аккаунт подтвержден для E-Mail {0}. Вы можете использовать /api/tokens для генерации JWT.

# FSH.WebApi.Infrastructure.Identity.UserService
source: An error occurred while confirming {0}
ru: Произошла ошибка при подтверждении {0}

# FSH.WebApi.Infrastructure.Identity.UserService
source: An error occurred while confirming Mobile Phone.
ru: Произошла ошибка при подтверждении мобильного телефона.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Account Confirmed for Phone Number {0}. You can now use the /api/tokens endpoint to generate JWT.
ru: Аккаунт подтвержден на номер телефона {0}. Теперь вы можете использовать /api/tokens конечную точку для генерации JWT.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Account Confirmed for Phone Number {0}. You should confirm your E-mail before using the /api/tokens endpoint to generate JWT.
ru: Учетная запись подтверждена на номер телефона {0}. Вы должны подтвердить свой адрес электронной почты перед использованием точки конца /api/tokens для генерации JWT.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Invalid objectId
ru: Не правильный objectId

# FSH.WebApi.Infrastructure.Identity.UserService
source: Username or Email not valid.
ru: Неверное имя пользователя или адрес электронной почты.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Username {0} is already taken.
ru: Имя пользователя {0} уже занято.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Email {0} is already taken.
ru: Email {0} уже используется.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Validation Errors Occurred.
ru: Возникли ошибки проверки.

# FSH.WebApi.Infrastructure.Identity.UserService
source: User {0} Registered.
ru: Пользователь {0} зарегистрирован.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Confirm Registration
ru: Подтвердите регистрацию

# FSH.WebApi.Infrastructure.Identity.UserService
source: User Not Found.
ru: Пользователь не найден.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Update profile failed
ru: Не удалось обновить профиль

# FSH.WebApi.Infrastructure.Identity.UserService
source: Invalid Tenant.
ru: Неверный арендатор.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Administrators Profile's Status cannot be toggled
ru: Статус профиля администратора не может быть переключен

# FSH.WebApi.Infrastructure.Identity.UserService
source: An Error has occurred!
ru: Произошла ошибка!

# FSH.WebApi.Infrastructure.Identity.UserService
source: Reset Password
ru: Сброс пароля

# FSH.WebApi.Infrastructure.Identity.UserService
source: Password Reset Mail has been sent to your authorized Email.
ru: Письмо для сброса пароля было отправлено на ваш авторизованный E-mail.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Password Reset Successful!
ru: Пароль успешно сброшен!

# FSH.WebApi.Infrastructure.Identity.UserService
source: Change password failed
ru: Не удалось сменить пароль

# FSH.WebApi.Infrastructure.Identity.UserService
source: Cannot Remove Admin Role From Root Tenant Admin.
ru: Невозможно удалить роль администратора от корневого администратора арендатора.

# FSH.WebApi.Infrastructure.Identity.UserService
source: Tenant should have at least 2 Admins.
ru: Владелец должен иметь не менее 2 Администраторов.

# FSH.WebApi.Infrastructure.Identity.UserService
source: User Roles Updated Successfully.
ru: Пользовательские роли успешно обновлены.

# FSH.WebApi.Infrastructure.Middleware.ExceptionMiddleware
source: Provide the ErrorId {0} to the support team for further analysis.
ru: Предоставьте в службу поддержки {0} ErrorId для дальнейшего анализа.

# FSH.WebApi.Infrastructure.Multitenancy.TenantService
source: Tenant is already Activated.
ru: Владелец уже активирован.

# FSH.WebApi.Infrastructure.Multitenancy.TenantService
source: Tenant {0} is now Activated.
ru: Владелец {0} активирован.

# FSH.WebApi.Infrastructure.Multitenancy.TenantService
source: Tenant is already Deactivated.
ru: Владелец уже деактивирован.

# FSH.WebApi.Infrastructure.Multitenancy.TenantService
source: {0} {1} Not Found.
ru: {0} {1} не найдено.
